[
    {
        "users": [],
        "dailyChallenges": [
            "1. Compliment a coworker or classmate.",
            "2. Ask someone about their day.",
            "3. Join a group conversation.",
            "4. Say hello to a neighbor.",
            "5. Invite someone for coffee or lunch.",
            "6. Reconnect with an old friend via text or call.",
            "7. Ask for someone’s opinion genuinely.",
            "8. Offer help to someone without being asked.",
            "9. Attend a community or school event.",
            "10. Share something personal in a group setting."
        ],
        "listDifficulty": 2,
        "title": "Simple Social Stretch",
        "description": "Ten easy social nudges to help you step out of your comfort zone and connect."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Strike up a conversation in line at a store.",
            "2. Invite someone to collaborate on a small task.",
            "3. Ask a stranger for directions or recommendations.",
            "4. Give someone a genuine compliment.",
            "5. Smile at five strangers today.",
            "6. Start a conversation with someone from a different background.",
            "7. Join a club or community group online or in person.",
            "8. Ask open-ended questions in conversation.",
            "9. Talk to someone you disagree with respectfully.",
            "10. Say thank you meaningfully to a service worker."
        ],
        "listDifficulty": 3,
        "title": "Daily Human Moments",
        "description": "This challenge helps you appreciate and initiate simple, meaningful interactions."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Call a friend you haven’t spoken to in months.",
            "2. Ask someone to share a memory with you.",
            "3. Give a handwritten thank-you note.",
            "4. Introduce two people you know who haven’t met.",
            "5. Share a funny story with someone new.",
            "6. Compliment someone on something non-physical.",
            "7. Host a small virtual hangout or meetup.",
            "8. Share your favorite podcast or book with a reason why.",
            "9. Ask a coworker or peer what they’re passionate about.",
            "10. Tell someone why you appreciate them."
        ],
        "listDifficulty": 3,
        "title": "Reconnect & Relate",
        "description": "Designed to deepen current relationships and spark new ones through real talk."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Post a thoughtful comment on someone’s social media.",
            "2. Send a supportive DM or email to someone doing something cool.",
            "3. Share something vulnerable with a friend.",
            "4. Ask someone about their culture or traditions.",
            "5. Tell a joke to a group and observe reactions.",
            "6. Make plans with someone you've only talked to briefly before.",
            "7. Invite feedback on something personal (e.g. art, writing).",
            "8. Play a game with someone new.",
            "9. Share your goals and ask about theirs.",
            "10. Talk to someone who seems left out."
        ],
        "listDifficulty": 4,
        "title": "Social Growth Spurt",
        "description": "A deeper dive into vulnerability, initiative, and connection through daily actions."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Organize a group activity (IRL or online).",
            "2. Volunteer in a team setting for 1 hour.",
            "3. Give a short speech or toast at a gathering.",
            "4. Attend a networking event.",
            "5. Ask someone older than you for life advice.",
            "6. Mentor someone younger or newer at something.",
            "7. Host a Q&A or live session on a topic you care about.",
            "8. Go on a walk and strike up three conversations.",
            "9. Ask someone about their biggest challenge right now.",
            "10. Start a new group chat for a shared interest."
        ],
        "listDifficulty": 5,
        "title": "Bold Connector Series",
        "description": "For those ready to take bold social initiative, create community, and be seen."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Say good morning to everyone you see today.",
            "2. Leave a kind note for a stranger.",
            "3. Share a favorite memory with someone.",
            "4. Learn a new name and remember it.",
            "5. Say 'thank you' three times more than usual.",
            "6. Offer a seat, umbrella, or charger to someone.",
            "7. Talk to someone with a visible disability or difference.",
            "8. Ask a friend how they’re *really* doing.",
            "9. Offer genuine praise to someone’s effort.",
            "10. Include someone new in your plans today."
        ],
        "listDifficulty": 2,
        "title": "Everyday Kindness Actions",
        "description": "Build social courage by spreading kindness with daily micro-actions."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Attend a public event you wouldn’t normally go to.",
            "2. Interview a stranger with 3 questions.",
            "3. Perform a random act of kindness anonymously.",
            "4. Collaborate with someone on a spontaneous project.",
            "5. Start a deep conversation with a close friend.",
            "6. Challenge a negative group behavior with grace.",
            "7. Share something emotional with a safe person.",
            "8. Lead a small group discussion.",
            "9. Mediate a disagreement peacefully.",
            "10. Reflect with someone on today's interactions."
        ],
        "listDifficulty": 5,
        "title": "Social Bravery Bootcamp",
        "description": "Push your social limits by leaning into bold, intentional interactions."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Ask someone what made them smile today.",
            "2. Share your favorite quote with a friend.",
            "3. Listen to someone without interrupting at all.",
            "4. Join a public chat or forum thread and engage.",
            "5. Say someone’s name when you greet them.",
            "6. Invite someone to share a meal.",
            "7. Reflect on your favorite conversation today.",
            "8. Create a shared playlist with a friend.",
            "9. Leave a voice note instead of texting.",
            "10. Share a personal story in a group chat."
        ],
        "listDifficulty": 2,
        "title": "Mindful Social Moments",
        "description": "These prompts focus on listening, intention, and meaningful micro-connections."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Say hello to a stranger on your commute.",
            "2. Ask a new question to someone you see often.",
            "3. Share an idea publicly (online or IRL).",
            "4. Tell someone what you admire about them.",
            "5. Give feedback on something you appreciated.",
            "6. Introduce yourself in an online forum.",
            "7. Text someone just to check in on them.",
            "8. Start a challenge with friends.",
            "9. Ask someone how they got into their field.",
            "10. Send a meme or joke to make someone laugh."
        ],
        "listDifficulty": 3,
        "title": "Connection Catalyst",
        "description": "Create sparks of connection and bridge everyday gaps through easy outreach."
    },
    {
        "users": [],
        "dailyChallenges": [
            "1. Attend a meetup or group you’ve never joined.",
            "2. Interview someone about their biggest lesson.",
            "3. Record a 1-minute message to inspire others.",
            "4. Get feedback on a tough situation from a peer.",
            "5. Offer encouragement to someone having a hard day.",
            "6. Invite someone new to an existing group.",
            "7. Reflect out loud on your progress today.",
            "8. Express gratitude publicly.",
            "9. Try a conversation starter from a card deck.",
            "10. Make a connection across generations."
        ],
        "listDifficulty": 4,
        "title": "Expanding Your Circle",
        "description": "Step-by-step challenges to grow your community and deepen your impact."
    }
]